app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.create!(comment_params.merge(post: @post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("title", "text", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "disagree"], ["text", "I disagree!"], ["post_id", 1]]