app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text") VALUES ($1, $2) RETURNING "id"  [["title", "test1"], ["text", "test"]]
---
  def create
    @post = Post.create!(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "text" = $1 WHERE "posts"."id" = $2  [["text", "test test"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)