app/controllers/users_controller.rb

  def sign_up!
    user = User.new(
      username: params[:username],
      password_digest: BCrypt::Password.create(params[:password])
    )
---
INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "adrian"], ["password_digest", "$2a$10$47OKx2C9EjdKGDXQNL9Db.UyyRZ08Qo4GQLMdok9NQ6AJRTriw7BW"]]

  def sign_in!
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = 'adrian' LIMIT 1